{
  "bio": [
      "Today, you're going grocery shopping.",
      "You're headed to Greenshop, the local supermarket, after a long day at work. It's getting pretty late, and you hope to finish your shopping quickly so you can spend a little time with your kids.",
      "After your spouse died three months ago, taking care of your two kids has been difficult. Your job waiting tables at a local restaurant is barely enough to make ends meet.",
      "Your son is six years old and suffers from severe asthma. He's very energetic and loves playing outside. He started 2nd grade last month, and he gets homesick easily. The loss has been especially tough on him because you now have to work so often.",
      "Your daughter is a bright 14 year old who is a straight-A student and loves theater. She had hoped to join the school's theater club, but could not because she babysits her younger brother after school each day.",
      "It's time to get this week's groceries."
    ],

  "story": [
    {
      "description": "You take a cart and head to the produce section. There's a lot of beautiful fruits and vegetables here.",
      "items": [
        {
          "name": "Apples",
          "description": "Bag of 8 apples",
          "price": 2.99,
          "quantity": 1,
          "notes": "This could be a quick and convenient snack for the family."
        },
        {
          "name": "Mango",
          "description": "It's a nice, ripe mango.",
          "price": 0.99,
          "quantity": 3,
          "notes": "While expensive, the kids really like mango slices for desert and school snacks."
        },
        {
          "name": "Raspberries",
          "description": "6oz Package of Driscoll's Premium Raspberries",
          "price": 2.50,
          "quantity": 1,
          "notes": "These are pricy, but they're your absolute favorite fruit. You've been working really hard lately, don't you deserve a treat?"
        },
        {
          "name": "Bananas",
          "description": "A bunch of bananas",
          "price": 1.20,
          "quantity": 0,
          "notes": "These would make a pretty nutritious and healthy snack."
        }
      ]
    },
    {
      "description": "You move onto the vegetables. Everything looks delicious.",
      "items": [
        {
          "name": "Mini sweet peppers",
          "description": "A pound of sweet Italian Cubanelle peppers",
          "price": 1.49,
          "quantity": 1,
          "notes": "These look nice, but you don't know when you'd have the time to actually cook them in something."
        },
        {
          "name": "Green beans",
          "description": "A 12 oz bag of green beans",
          "price": 2.00,
          "quantity": 2,
          "notes": "These beans are nice and fresh, and you need to feed your kids vegetables. Your kids seem to prefer the canned version though."
        },
        {
          "name": "Potatoes",
          "description": "A 5lb bag of Florida Red Potatoes",
          "price": 2.29,
          "quantity": 2,
          "notes": "Cooking these will take some time, but the kids always like your potatoes."
        },
        {
          "name": "Broccoli",
          "description": "A pound of broccoli",
          "price": 2.50,
          "quantity": 1,
          "notes": "You don't mind the taste, but your kids definitely don't enjoy broccoli."
        },
        {
          "name": "Carrots",
          "description": "A one pound bag of carrots",
          "price": 2.00,
          "quantity": 1,
          "notes": "Just another vegetable."
        }
      ]
    },

    {
      "description": "You pass the deli and remember that your son has been having a tough time at school lately. Even though he qualifies for free lunches at his school, other students have been bullying him for being a 'free lunch kid.' He hasn't been eating lunch because he wants to bring his own.",
      "items": [
        {
          "name": "Lunchables",
          "description": "Pepperoni Pizza, Capri Sun, and a fun-sized snickers!",
          "price": 4.99,
          "quantity": 1,
          "notes": "Your son has been begging you for these all week."
        }
      ]
    },

    {
      "description": "You stop by the deli section briefly.",
      "items": [
        {
          "name": "Ham",
          "description": "1lb of Thinly Sliced Cooked Ham",
          "price": 4.99,
          "quantity": 2,
          "notes": "This would make for great sandwiches. Sophie strongly dislikes the school lunches, but has been eating them because she is a good sport. Buying her some sandwich supplies would make her very happy."
        },{
          "name": "American Cheese",
          "description": "1lb of American Sliced Cheese",
          "price": 2.99,
          "quantity": 1,
          "notes": "In addition to being a necessity for sandwiches, this cheese makes a gerat snack on its own."
        }
      ]
    },

    {
      "description": "You leave the deli and make your way to the meat section.",
      "items": [
        {
          "name": "Chicken Breast",
          "description": "1lb of Boneless Chicken Breast",
          "price": 5.99,
          "quantity": 1,
          "notes": "All natural chicken breast. It's healthy, but it's more expensive than drums or thighs."
        },
        {
          "name": "Chicken Thighs",
          "description": "1lb of Boneless Chicken Thighs",
          "price": 1.99,
          "quantity": 3,
          "notes": "All natural. The kids always love your chicken, only problem is finding the time to cook it. You don't even get home from work until after 6pm."
        },
        {
          "name": "Bacon",
          "description": "12oz - 16oz package of Carando Sliced Bacon",
          "price": 2.99,
          "quantity": 1,
          "notes": "Put some bacon in your vegetables will make the kids a lot more likely to eat them."
        },
        {
          "name": "Steak",
          "description": "a pound of USDA sirloin steak",
          "price": 8.99,
          "quantity": 0,
          "notes": "Both you and your kids love steak, when you can afford it."
        }
      ]
    },

    {
      "description": "You move down the aisles looking for some common staples",
      "items": [
        {
          "name": "Pasta",
          "description": "a pound of dry pasta",
          "price": 1.69,
          "quantity": 5,
          "notes": "Pasta is an inexpensive staple in your house."
        },
        {
          "name": "Rice",
          "description": "a 10 pound bag of rice",
          "price": 14.99,
          "quantity": 1,
          "notes": "A little rice goes a long way. You're out of rice, and you always buy bulk."
        },
        {
          "name": "Black Beans",
          "description": "a 1 pound can of black beans.",
          "price": 1.20,
          "quantity": 4,
          "notes": "These are really filling and go great with rice."
        }
      ]
    },

    {
      "description": "On your way to frozens you pass by the baking isle. Sophie's best friend's birthday is coming up soon, and she wants to bake her a cake.",
      "items": [
        {
          "name": "Cake Mix",
          "description": "Funfetti Cake Mix",
          "price": 1.69,
          "quantity": 1,
          "notes": "This looks like it'd be a really fun cake to make."
        },
        {
          "name": "Muffin Mix",
          "description": "Betty Crocker Muffin Mix Box",
          "price": 3.19,
          "quantity": 1,
          "notes": "Sophie would enjoy baking these, and then you would have breakfast/snacks for a few days too."
        },{
          "name": "Frosting",
          "description": "A tub of Betty Crocker Frosting",
          "price": 2.19,
          "quantity": 1,
          "notes": "The kids will be disappointed if they don't have frosting for the muffins."
        }
      ]
    },

    {
      "description": "Next stop: frozen foods.",
      "items": [
        {
          "name": "Frozen macaroni and cheese",
          "description": "A Macaroni and Cheese Meal that Serves 3",
          "price": 2.00,
          "quantity": 3,
          "notes": "Working a 10 hour day is exhausting, and this would save Alexa a great deal of time from cooking which she instead use to spend time with her children"
        },
        {
          "name": "Mixed vegetables",
          "description": "A large bag of frozen corn, peas, and carrots",
          "price": 2.00,
          "quantity": 2,
          "notes": "It's important to get vegetables, and while these aren't as healthy or tasty as fresh vegetables, they do save Alexa the time of cutting the vegetables. But, it has been hard to get Paul and Sophie to eat the vegetables - they tend to throw them away."
        },
        {
          "name": "Frozen waffles",
          "description": "8 Eggo frozen waffles",
          "price": 2.00,
          "quantity": 2,
          "notes": "The past two months, the family has been eating cereal for breakfast. The kids (and Alexa) have been getting sick of it, so this would be a nice treat to start the day"
        },
        {
          "name": "Hood Ice Cream",
          "description": "From the New England Creamery",
          "price": 5.00,
          "quantity": 1,
          "notes": "A summer treat and Sophie's favourite flavor. Bringing this home would make the kids really happy, especially since you haven't been able to spend as much time with them lately."
        },
        {
          "name": "Healthy Choice Frozen Dinner",
          "description": "Frozen Dinner that Serves One",
          "price": 3.80,
          "quantity": 3,
          "notes": "All you have to do is put this in the microwave and boom! Instant dinner. This is a quick way to feed the kids while running on a tight schedule."
        },
        {
          "name": "Cole's Cheesesticks",
          "description": "An 11oz Package: Asiago and Prezel",
          "price": 2.00,
          "quantity": 2,
          "notes": "Paul inhales these like they're air and Sophie loves taking them for her school snacks."
        }
      ]
    },


    {
      "description": "Before you leave, you stop by the snack section to pick up some treats for Friday's family movie night. You want to somewhat spoil the kids because you aren't able to take them to the new Avengers movie at the theatre.",
      "items": [
        {
          "name": "Kettle Potato Chips",
          "description": "8.5oz Bag of Potato Chips",
          "price": 2.50,
          "quantity": 1,
          "notes": "These are Sophie's favorite chips."
        },{
          "name": "Doritos",
          "description": "11oz Bag of Cheesy Doritos",
          "price": 2.50,
          "quantity": 1,
          "notes": "These are Paul's favorite chips."
        },{
          "name": "El Sabroso Tortilla Chips",
          "description": "12oz Bag of Potato Chips",
          "price": 2.50,
          "quantity": 1,
          "notes": "These are your favorite chips."
        },{
          "name": "Apple Juice",
          "description": "Apple & Eve 100% Apple Juice, 64oz Bottle",
          "price": 2.50,
          "quantity": 1,
          "notes": "Everyone in the family likes apple juice. Without this, there will be nothing to balance the dryness of the chips in your mouth."
        }
      ]
    },

    {
      "description": "Your shopping trip is almost over. Your last stop is the dairy aisle.",
      "items": [
        {
          "name": "Whole milk",
          "description": "A gallon of Shaws-Brand Whole Milk",
          "price": 3.19,
          "quantity": 2,
          "notes": "Kids need the calcium and vitamin D in milk. But on top of that, Paul has been having trouble sleeping recently, and a glass of milk before bed helps him sleep."
        },
        {
          "name": "Yogurt",
          "description": "6-pack of 'Danimals' yogurt cups",
          "price": 2.00,
          "quantity": 2,
          "notes": "It's not as healthy as organic greek yogurt, but the kids need something for their snack time at school. The past few weeks, they haven't been taking anything."
        },
        {
          "name": "Greek Yogurt",
          "description": "Organic, greek yogurt",
          "price": 5.00,
          "quantity": 1,
          "notes": "Protein rich - a healthy option for the childens' snacktime at school"
        },
        {
          "name": "Eggs",
          "description": "One dozen large eggs",
          "price": 2.79,
          "quantity": 1,
          "notes": "Eggs are easy to to prepare and nutritious. Totally egg-cellent."
        }
      ]
    }
  ]
}
