{
  "bio": "Alexa Hansen is a 32 year old widowed mother from Ridgeport, Mississippi. After her husband died three months ago, she moved into a small 2-bedroom apartment with her two children, Paul and Sophie. She recently got a job as a waitress at a local restaurant. It does not pay very well, but it is her primary source of income. She starts work at 8AM to and leaves at 6PM. Paul is four years old and suffers from severe asthma. He's very energetic and loves playing outside. He started preschool last month, and he gets homesick easily. It has been especially tough for him now because he lost his father and because his mother has to work so often. Sophie is a bright 14 year old who is a straight-A student and loves theater. She had hoped to join the school's theater club, but could not because she babysits her younger brother after school each day. Today, Alexa has gone to Greenshop, the local supermarket, after spending the day working. She will buy groceries and hopes to return home to spend a little time with her kids before they go to sleep.",
  "items": [
    {
      "notes": "Kids need the calcium and vitamin D in milk. But on top of that, Paul has been having trouble sleeping recently, and a glass of milk before bed helps him sleep.",
      "price": 1.29,
      "name": "Whole milk",
      "description": "A gallon of Greenshop-brand whole milk"
    },
    {
      "notes": "It's not as healthy as organic greek yogurt, but the kids need something for their snack time at school. The past few weeks, they haven't been taking anything.",
      "price": 2.0,
      "name": "Yogurt",
      "description": "6-pack of 'Danimals' yogurt cups"
    },
    {
      "notes": "Protein rich - a healthy option for the childens' snacktime at school",
      "price": 5.0,
      "name": "Greek Yogurt",
      "description": "Organic, greek yogurt"
    },
    {
      "notes": "Working a 10 hour day is exhausting, and this would save Alexa a great deal of time from cooking which she instead use to spend time with her children",
      "price": 2.0,
      "name": "Frozen macaroni and cheese",
      "description": "Macaroni and cheese - serves 3"
    },
    {
      "notes": "It's important to get vegetables, and while these aren't as healthy or tasty as fresh vegetables, they do save Alexa the time of cutting the vegetables. But, it has been hard to get Paul and Sophie to eat the vegetables - they tend to throw them away",
      "price": 1.0,
      "name": "Mixed vegetables",
      "description": "A bag of frozen corn, peas, and carrots"
    },
    {
      "notes": "The past two months, the family has been eating cereal for breakfast. The kids (and Alexa) have been getting sick of it, so this would be a nice treat to start the day",
      "price": 2.0,
      "name": "Frozen waffles",
      "description": "8 Eggo frozen waffles"
    },
    {
      "notes": "This would be a quick and convenient snack for the family. However, it's quite pricy",
      "price": 2.99,
      "name": "Apples",
      "description": "Bag of 8 apples"
    },
    {
      "notes": "While expensive, the kids might actually eat this",
      "price": 0.99,
      "name": "Mango",
      "description": "Ataulfo mangos"
    },
    {
      "notes": "These look nice, but Alexa doesn't know when she'll have the time to actually cook them in something",
      "price": 1.49,
      "name": "Mini sweet peppers",
      "description": "A pound of sweet Italian Cubanelle peppers"
    },
    {
      "notes": "Cooking these into a dish may be hard, but Alexa thinks she may be able to steam them. But would the kids eat this?",
      "price": 2.0,
      "name": "Green beans",
      "description": "A 12 oz bag of green beans"
    }
  ]
}